# AreObjectsAvailable Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
TessellatedShapeBuilderResult..::..AreObjectsAvailable Property
TessellatedShapeBuilderResult Class See Also
---
Shows whether 'issues' still contains the original data or whether these data have already been relinquished by 'getGeometricalObjects'. The former is true, the later is false.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public bool AreObjectsAvailable { get; }
```

Visual Basic
---
```text
Public ReadOnly Property AreObjectsAvailable As Boolean
	Get
```

Visual C++
---
```text
public:
property bool AreObjectsAvailable {
	bool get ();
}
```

# See Also
TessellatedShapeBuilderResult Class
Autodesk.Revit.DB Namespace